Вопросы для самопроверки:

1.Что такое байт-код и почему он так важен для интернет-программирования на
языке Java?
- Байт-код - упрощенное представление программы после компиляции класса Java. Данный код делает программы на Java независимыми от платформ, достаточно иметь на устройстве JVM как интерпретатор кода.

2. Каковы три ключевых принuипа объектно-ориентированного программирования?

- Инкапсуляция, наследования и полиморфизм.

3. С чего начинается выполнение программы на Java?

- Входная точка - это метод Main: public statis void Main (String args[]) {;} 

4. Что такое переменная?

- Переменная - это зарезервированная и изменяемая область памяти, которой соответствует конкретное имя и значение. Именованный участок памяти.

5. Какое из перечисленных ниже имен переменных недопустимо?
А. count
Б. $count
В. count27
Г. 67count

- Ответ: Г

6. Как создаются однострочный и мноrострочный комментарии?

- Однострочный комментарий начинается //, а многострочный - с /* */. 

7. Как выглядит общая форма условного оператора i f? Как выглядит общая форма
uикла for?

- Цикл if
if (bool_condition) {
    statement;
}

- Цикл for
for (initialization; termination; increment)    {
    statement(s);
}

8. Как создать блок кода?

Поместить операторы в фигурные скобки.

9. Сила тяжести на Луне составляет около 17% земной. Напишите программу, которая вычислила бы ваш вес на Луне.
12 футов через каждый дюйм. После каждых 12 дюймов выведите пустую строку.
(Один метр приблизительно равен 39,37 дюйма.)

class InchesInMeters {
    public static void main(String[] args) {
        double meter;
        int counter;
        int inch;
        int foot;

        counter = 0;       
        foot = 12 * 12; 

        for (inch = 1; inch <= foot; inch++) {
            meter = inch / 39.37;

            System.out.println(inch + " дюйму соответствует " + meter + " метра.");

            counter++; 

            if (counter == 12) {       
                System.out.println();
                counter = 0;           
            }
        }
    }
}

11. Если при вводе кода программы вы допустите опечатку, то какого рода сообщение
об ошибке получите?

- Согласно правилам, если при наборе кода совершена ошибка, то при компиляции исходного кода в байт-код, компилятор выдаст сообщение об ошибке с примерным местоположением ошибки.

12. Имеет ли значение, с какой именно позиuии в строке начинается инструкuия?

- Нет ни имеет, единственное требование - наличие ";" в конце каждой инструкции.
